{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Viterbi algorithm.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "IJakIH5RzVLW"
      },
      "source": [
        "# Алгоритм Витербри\n",
        "\n",
        "---\n",
        "\n",
        "Алгоритм Витерби - алгоритм поиска наибольшего подходящего списка состояний (называемого путём Витерби), который в контексте цепей Маркова получает вероятную поледовательность произошедших событий.\n",
        "\n",
        "---\n",
        "\n",
        "Является алгоритмом динамического программирования. Применяется  в алгоритме свёрточного декодирования Витербри. \n",
        "\n",
        "---\n",
        "\n",
        "# Описание алгоритма\n",
        "\n",
        "---\n",
        "\n",
        "\n",
        "Пусть существует скрытая марковская модель (СММ) с пространством состояний \\begin{array}{rcl}S&=&\\{s_1,s_2,...,s_{k}\\}\\end{array} где K — количество возможных различных состояний сети. При этом состояния, которые принимает сеть, невидимы для наблюдения. Обозначим через \\begin{array}{rcl}x_{t}\\end{array} состояние сети в момент t. На выходе сети в момент t появляется видимое для наблюдения значение  \\begin{array}{rcl} y_{t}\\in O=\\{o_{1},o_{2},\\dots ,o_{N }\\}\\end{array} где N — число возможных различных наблюдаемых значений на выходе. Пусть \\begin{array}{rcl}\\pi_{i}\\end{array} — начальная вероятность нахождения сети в состоянии i, а \\begin{array}{rcl} a_{i,j} \\end{array} — вероятности перехода сети из состояния ***i*** в состояние ***j***.\n",
        "\n",
        "Пусть на выходе сети наблюдается последовательность \\begin{array}{rcl} y_{1},\\dots ,y_{T} \\end{array}\n",
        "Тогда наиболее вероятная последовательность состояний сети \\begin{array}{rcl}x_{1},\\dots ,x_{T}\\end{array} для наблюдаемой последовательности может быть определена с помощью следующих рекуррентных соотношений:\n",
        "\n",
        "\\begin{array}{rcl}V_{1,k}&=&\\mathrm {P} {\\big (}y_{1}\\ |\\ k{\\big )}\\cdot \\pi _{k}\\\\V_{t,k}&=&\\max _{x\\in S}\\left(\\mathrm {P} {\\big (}y_{t}\\ |\\ k{\\big )}\\cdot a_{x,k}\\cdot V_{t-1,x}\\right)\\end{array}\n",
        "Здесь \\begin{array}{rcl}V_{t,k}\\end{array} — это вероятность наиболее вероятной последовательности состояний, соответствующей первым ***t*** наблюдаемым значениям, завершающейся в состоянии ***k***. Путь Витерби может быть найден при помощи указателей, запоминающих, какое состояние ***x*** появлялось во втором уравнении. Пусть  \\begin{array}{rcl}\\mathrm {Ptr}(k,t)\\end{array} — функция, которая возвращает значение *x*, использованное для подсчета \\begin{array}{rcl}V_{t,k}\\end{array} если t>1 или k если t=1. Тогда\n",
        "\\begin{array}{rcl}x_{T}&=&\\arg \\max \\limits _{x\\in S}(V_{T,x})\\\\x_{t-1}&=&\\mathrm {Ptr} (x_{t},t)\\end{array}\\\n",
        "Здесь мы используем стандартное определение arg max.\n",
        "Сложность этого алгоритма равна  \\begin{array}{rcl}O(T\\times \\left|{S}\\right|^{2})\\end{array}\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "g1hUHwLhNB9r"
      },
      "source": [
        "# Применение алгоритма и реализация на Python\n",
        "\n",
        "---\n",
        "\n",
        "Алгоритм используется в CDMA и GSM цифровой связи, в модемах и космических коммуникациях. Он нашёл применеие в распознавании речи и письма, компьютерной лингвистике и биоинформатике, а также в алгоритме свёрточного декодирования Витерби.\n",
        "\n",
        "---\n",
        "\n",
        "# Пример реализации на Python\n",
        "\n",
        "---\n",
        "\n",
        "Допустим на входе мы имеем скрытую Марковскую модель, а также наблюдаемую последовательность. Нашей задачей будет найти такую последовательность состояний, которая \"объяснит\" наблюдаемую последовательность лучше всего.\n",
        "\n"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "zTNvVpiqySdG",
        "outputId": "4e14536f-1a8c-4d3e-975e-e9b806698633"
      },
      "source": [
        "import numpy as np\n",
        "\n",
        "def viterbi(A, C, B, O):\n",
        "    \"\"\"\n",
        "    Входные элементы:\n",
        "        A (np.ndarray): Матрица вероятностей перехода состояний размерностью I x I\n",
        "        C (np.ndarray): Начальное распределение состояний размерностью I\n",
        "        B (np.ndarray): Матрица вероятностей вывода размерностью I x K\n",
        "        O (np.ndarray): Наблюдаемая последовательность длиной N\n",
        "\n",
        "    Вывод:\n",
        "        S_opt (np.ndarray): Оптимальная последовательность длиной N\n",
        "        D (np.ndarray): Матрица накопленных вероятностей\n",
        "        E (np.ndarray): Возвратная матрица\n",
        "    \"\"\"\n",
        "    I = A.shape[0]    # Количество состояний\n",
        "    N = len(O)  # Длина наблюдаемой последловательности\n",
        "\n",
        "    # Инициализация матриц D и E\n",
        "    D = np.zeros((I, N))\n",
        "    E = np.zeros((I, N-1)).astype(np.int32)\n",
        "    D[:, 0] = np.multiply(C, B[:, O[0]])\n",
        "\n",
        "    # Вычисление матрицы накопленных вероятностей и возвратной\n",
        "    for n in range(1, N):\n",
        "        for i in range(I):\n",
        "            temp_product = np.multiply(A[:, i], D[:, n-1])\n",
        "            D[i, n] = np.max(temp_product) * B[i, O[n]]\n",
        "            E[i, n-1] = np.argmax(temp_product)\n",
        "\n",
        "    # Поиск оптимальной последовательности через возвратную матрицу\n",
        "    S_opt = np.zeros(N).astype(np.int32)\n",
        "    S_opt[-1] = np.argmax(D[:, -1])\n",
        "    for n in range(N-2, -1, -1):\n",
        "        S_opt[n] = E[int(S_opt[n+1]), n]\n",
        "\n",
        "    return S_opt, D, E\n",
        "\n",
        "# Входные параметры\n",
        "A = np.array([[0.8, 0.1, 0.1], \n",
        "              [0.2, 0.7, 0.1], \n",
        "              [0.1, 0.3, 0.6]])\n",
        "\n",
        "C = np.array([0.6, 0.2, 0.2])\n",
        "\n",
        "B = np.array([[0.7, 0.0, 0.3], \n",
        "              [0.1, 0.9, 0.0], \n",
        "              [0.0, 0.2, 0.8]])\n",
        "\n",
        "O = np.array([0, 2, 0, 2, 2, 1]).astype(np.int32)\n",
        "\n",
        "# Применяем алгоритм Витерби\n",
        "S_opt, D, E = viterbi(A, C, B, O)\n",
        "\n",
        "print('Наблюдаемая последовательность:   O = ', O)\n",
        "print('Оптимальная последовательность:   S = ', S_opt)\n",
        "#np.set_printoptions(formatter={'float': \"{: 7.4f}\".format})\n",
        "#print('D =', D, sep='\\n')\n",
        "#np.set_printoptions(formatter={'float': \"{: 7.0f}\".format})\n",
        "#print('E =', E, sep='\\n')"
      ],
      "execution_count": 5,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Наблюдаемая последовательность:   O =  [0 2 0 2 2 1]\n",
            "Оптимальная последовательность:   S =  [0 0 0 2 2 1]\n"
          ],
          "name": "stdout"
        }
      ]
    }
  ]
}